[
  {
    "comment": "Yeqing was always eager to help me and responded to emails incredibly quickly. She is clearly a caring person and encourages deep thinking.",
    "course": "IDS 201 Fall 2018"
  },
  {
    "comment": "Yeqing Kong is an incredibly caring person and always responds quickly and politely. She sends us reminders often so I can tell she wants us to succeed.",
    "course": "IDS 201 Fall 2018"
  },
  {
    "comment": "Ms. Kong is a nice, professional instructor. Her teaching is fantastic and I wouldn't hesitate to take her again!",
    "course": "IDS 201 Fall 2018"
  },
  {
    "comment": "While this is an online class the instructor made it known that she was will to help us in any way possible and was very prompt at responding to students questions.",
    "course": "IDS 201 Fall 2018"
  },
  {
    "comment": "I really enjoyed this course and felt like I recieved a solid introduction to environmental ethics. The subject matter was broad and engaging.",
    "course": "IDS 201 Fall 2018"
  },
  {
    "comment": "I really enjoyed the design of this course. It was easy to understand, the material was free and informative, and I always knew what was expected of me.",
    "course": "IDS 201 Fall 2018"
  },
  {
    "comment": "The format of this class was perfect for distance education. Very well laid out and streamlined.",
    "course": "IDS 201 Fall 2018"
  },
  {
    "comment": "She is really nice. As an instructor, she was really patient and friendly to students, and was always happy to help.",
    "course": "IDS 201 Fall 2018"
  },
  {
    "comment": "This was a really interesting course and you made it enjoyable!",
    "course": "IDS 201 Fall 2018"
  },
  {
    "comment": "Yequing was really attentive and provided a lot of information for the course. She was also very organized.",
    "course": "IDS 201 Fall 2018"
  },
  {
    "comment": "The course really helped me understand the importance of writing in the sciences and the intricacies within it.",
    "course": "ENG 333 Fall 2019"
  },
  {
    "comment": "Everything was great about the course and I genuinely had an enjoyable time.",
    "course": "ENG 333 Fall 2019"
  },
  {
    "comment": "She did a really great job! I like the weekly posts! They are engaging and help improve your grade :)",
    "course": "ENG 333 Fall 2019"
  },
  {
    "comment": "Ms. Kong was a great instructor and was very responsive to emails when questions arose.",
    "course": "ENG 333 Fall 2019"
  },
  {
    "comment": "Very interactive course with other peers",
    "course": "ENG 333 Fall 2019"
  }
]